phunguyenhoangminh-gif/STM32LAB1/LAB1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_N_RED_Pin GPIO_PIN_1
#define LED_N_RED_GPIO_Port GPIOA
#define LED_N_YEL_Pin GPIO_PIN_2
#define LED_N_YEL_GPIO_Port GPIOA
#define LED_N_GRN_Pin GPIO_PIN_3
#define LED_N_GRN_GPIO_Port GPIOA
#define LED_S_RED_Pin GPIO_PIN_4
#define LED_S_RED_GPIO_Port GPIOA
#define LED_S_YEL_Pin GPIO_PIN_5
#define LED_S_YEL_GPIO_Port GPIOA
#define LED_S_GRN_Pin GPIO_PIN_6
#define LED_S_GRN_GPIO_Port GPIOA
#define LED_E_RED_Pin GPIO_PIN_7
#define LED_E_RED_GPIO_Port GPIOA
#define SEG_A_Pin GPIO_PIN_0
#define SEG_A_GPIO_Port GPIOB
#define SEG_B_Pin GPIO_PIN_1
#define SEG_B_GPIO_Port GPIOB
#define SEG_C_Pin GPIO_PIN_2
#define SEG_C_GPIO_Port GPIOB
#define LED_E_YEL_Pin GPIO_PIN_8
#define LED_E_YEL_GPIO_Port GPIOA
#define LED_E_GRN_Pin GPIO_PIN_9
#define LED_E_GRN_GPIO_Port GPIOA
#define LED_W_RED_Pin GPIO_PIN_10
#define LED_W_RED_GPIO_Port GPIOA
#define LED_W_YEL_Pin GPIO_PIN_11
#define LED_W_YEL_GPIO_Port GPIOA
#define LED_W_GRN_Pin GPIO_PIN_12
#define LED_W_GRN_GPIO_Port GPIOA
#define SEG_D_Pin GPIO_PIN_3
#define SEG_D_GPIO_Port GPIOB
#define SEG_E_Pin GPIO_PIN_4
#define SEG_E_GPIO_Port GPIOB
#define SEG_F_Pin GPIO_PIN_5
#define SEG_F_GPIO_Port GPIOB
#define SEG_G_Pin GPIO_PIN_6
#define SEG_G_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
